#include <iostream>
using namespace std;

int main() {
  double a1 = 1.0 + 1e-16;
  double b1 = 1.0 + 1.2*1e-16;
  double c1 = 1.0 + 1.1*1e-16;
  printf("a1 = %.20e\n",a1);
  printf("b1 = %.20e\n",b1);
  printf("c1 = %.20e\n",c1);
  /* a1 = 1.00000000000000000000e+00, b1 = 1.00000000000000022204e+00, */
  /* c1 = 1.00000000000000000000e+00 */
  /* 理由:マシンイプシロン εM = 2−52 ≈ 2.2×10−16.1.1∗1e−16 < εM なので，1.0+1e−16 = */
  /* 2 */
  /* 1.0, 1.0+1.1∗1e−16 = 1.0になる.1.2∗1e−16 > εM であるから，最近点への丸めに 2 */
  /* よって，1.0+1.2∗1e−16 = 1.0+εM になる. */
}
